QUIZ_DATA = [
    {
        "q": "1. Яким має бути твій нікнейм у Zoom?",
        "options": ["Ігровий нік", "Ім’я та Прізвище англійською", "Ім'я українською"],
        "correct": 1
    },
    {
        "q": "2. Що потрібно робити з камерою під час уроку?",
        "options": ["Вмикати тільки для відповіді", "Увімкнена протягом усього заняття", "Можна не вмикати"],
        "correct": 1
    },
    {
        "q": "3. Кому можна передавати посилання на урок або розклад?",
        "options": ["Другу або брату/сестрі", "Тільки батькам", "Нікому, це конфіденційно"],
        "correct": 2
    },
    {
        "q": "4. Яка мова є офіційною для спілкування у чаті Zoom?",
        "options": ["Будь-яка", "Українська", "Тільки англійська"],
        "correct": 2
    },
    {
        "q": "5. Яке мінімальне навантаження на тиждень ти маєш виконувати?",
        "options": ["Мінімум 3 уроки на тиждень", "Кількість не має значення", "Достатньо 1 уроку"],
        "correct": 0
    },
    {
        "q": "6. Хто нараховує House Points і як швидко вони з'являються?",
        "options": ["Вчитель одразу", "Префекти протягом 1–3 днів", "Адміністратор раз на місяць"],
        "correct": 1
    },
    {
        "q": "7. Що станеться, якщо пропустити 3 уроки поспіль без попередження?",
        "options": ["Автоматичне видалення", "Дзвінок батькам", "Штрафні бали"],
        "correct": 0
    },
    {
        "q": "8. Ти погоджуєшся з Правилами Svitlo? ✅",
        "options": ["Так, погоджуюсь", "Ні"],
        "correct": 0
    }
]