LEAD_WELCOME_MSG = (
        "Раді тебе бачити!\n"
        "⏱️ Подача заявки до Svitlo School займає близько 17 хвилин.\n\n"
        "<b>Перш ніж почати, переконайся, що маєш:</b>\n"
        "✅ Контактні дані одного з твоїх батьків/опікунів\n"
        "✅ Твоя ID-картка, закордонний паспорт або свідоцтво про народження\n\n"
        "<b>Тобі слід буде пройти три простих етапи:</b>\n"
        "1️⃣ Особиста інформація (~10 хвилин)\n"
        "2️⃣ Правила школи (~5 хвилин)\n"
        "3️⃣ Фото твого документу (~2 хвилини)\n\n"
        "<b>Коли будеш готовий, тисни нижче</b>"
    )

LEAD_INTERLUDE_1_MSG = (
        "<b>🎉 Етап 1 «Особиста інформація» пройдено!</b> Наступний крок:\n\n"
        "<b>Етап 2 «Правила школи»</b>\n"
        "<blockquote>ℹ️ Важливо детально ознайомитися з правилами школи, адже їх зобов'язані дотримуватись всі учні, та вони визначають умови виключення учнів за неактивність</blockquote>\n\n"
        "Після ознайомлення на тебе чекає коротке опитування з 5 питань. Тисни, щоб перейти до правил 👇"
    )

RULES_MSG = (
    "<b>💡 Правила Svitlo School складаються з таких блоків:</b>\n\n"
    "1. Цифрова ідентифікація\n"
    "2. Безпека твого простору\n"
    "3. Культура роботи на уроці\n"
    "4. Відвідуваність та перевірка\n"
    "5. Система House Points\n"
    "6. Інші важливі умови\n\n"
    "<b><a href='https://telegra.ph/Pravila-ta-kultura-Svitlo-School-07-21'>📖 Обовʼязково натисни сюди, щоб прочитати повний зміст цих правил</a></b>"
    "<b>Як тільки ти ознайомишся із всіма пунктами, ти зможеш впевнено пройти опитування!</b> Натискай кнопку нижче, коли будеш готовий(-а) 💪"
)

QUIZ_DATA = [
    {
        "q": "1. Яким має бути твій нікнейм у Zoom?",
        "options": ["Ігровий нік", "Ім’я та Прізвище англійською", "Ім'я українською"],
        "correct": 1
    },
    {
        "q": "2. Що потрібно робити з камерою під час уроку?",
        "options": ["Вмикати тільки для відповіді", "Увімкнена протягом усього заняття", "Можна не вмикати"],
        "correct": 1
    },
    {
        "q": "3. Кому можна передавати посилання на урок або розклад?",
        "options": ["Другу або брату/сестрі", "Тільки батькам", "Нікому, це конфіденційно"],
        "correct": 2
    },
    {
        "q": "4. Яка мова є офіційною для спілкування у чаті Zoom?",
        "options": ["Будь-яка", "Українська", "Тільки англійська"],
        "correct": 2
    },
    {
        "q": "5. Яке мінімальне навантаження на тиждень ти маєш виконувати?",
        "options": ["Мінімум 3 уроки на тиждень", "Кількість не має значення", "Достатньо 1 уроку"],
        "correct": 0
    },
    {
        "q": "6. Хто нараховує House Points і як швидко вони з'являються?",
        "options": ["Вчитель одразу", "Префекти протягом 1–3 днів", "Адміністратор раз на місяць"],
        "correct": 1
    },
    {
        "q": "7. Що станеться, якщо пропустити 3 уроки поспіль без попередження?",
        "options": ["Автоматичне видалення", "Дзвінок батькам", "Штрафні бали"],
        "correct": 0
    },
    {
        "q": "8. Ти погоджуєшся з Правилами Svitlo? ✅",
        "options": ["Так, погоджуюсь", "Ні"],
        "correct": 0
    }
]

LEAD_INTERLUDE_2_MSG = (
        "<b>🎉 Well done [Name]!</b>\n"
        "<b>✅ Етап 2 «Правила школи» успішно пройдено!</b> Фінальний крок:\n\n"
        "<b>Етап 3 «Фото документа»</b>\n"
        "<blockquote>ℹ️ Нам потрібне фото твого паспорта, ID-картки або свідоцтва про народження для підтвердження особи. Це допомагає зробити Svitlo School безпечною для всіх</blockquote>"
    )

SCANNER_MSG = (
    "Коли ти натиснеш <b>«Сканувати документ»</b>, бот відкриє конфіденційний міні-сканер та запросить доступ до камери. Будь ласка, надай дозвіл та зроби фото документа\n\n"
    "<b>Поради для успішної фотоверифікації:</b>\n"
    "✔️ Переконайся, що в кімнаті добре освітлення\n"
    "✔️ Усі чотири кути документа має бути видно\n"
    "✔️ Фото має бути чітким, а не розмитим\n"
    "<blockquote><b>🔐 Важливо:</b> ми не зберігаємо фото твого документа на наших чи сторонніх серверах. Ми цінуємо твою конфіденційність та приватність, тому система перевіряє документ на льоту</blockquote>"
)